# Object creation

In [1]:
s = pd.Series([1, 3, 5, np.nan, 6, 9])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    9.0
dtype: float64

In [2]:
dates = pd.date_range('20200622', periods=6)
dates

DatetimeIndex(['2020-06-22', '2020-06-23', '2020-06-24', '2020-06-25',
               '2020-06-26', '2020-06-27'],
              dtype='datetime64[ns]', freq='D')

In [3]:
df = pd.DataFrame(np.random.randn(6, 4), index = dates, columns=list('ABCD'))
df

                   A         B         C         D
2020-06-22 -0.543073  1.234097  0.862813  2.059473
2020-06-23  1.086249  1.342239  0.498422  0.399590
2020-06-24  0.088308 -0.768431 -1.241454  0.768109
2020-06-25 -0.330019  1.589567  0.245061  0.894598
2020-06-26 -0.243519 -0.436227 -1.398266  1.525374
2020-06-27  0.670634 -0.365394 -1.289230  0.065882

In [4]:
df2 = pd.DataFrame({
    'a': 1.,
    'b': pd.Timestamp('20200622'),
    'c': pd.Series(1, index=list(range(4)), dtype = 'float32'),
    'd': np.array([3] * 4, dtype='int32'),
    'e': pd.Categorical(["test", "train", "test","train"]),
    'f': 'foo'
    
})
df2

     a          b    c  d      e    f
0  1.0 2020-06-22  1.0  3   test  foo
1  1.0 2020-06-22  1.0  3  train  foo
2  1.0 2020-06-22  1.0  3   test  foo
3  1.0 2020-06-22  1.0  3  train  foo

In [5]:
df2.dtypes # dtypes

a           float64
b    datetime64[ns]
c           float32
d             int32
e          category
f            object
dtype: object

df2.<tab>

# Viewing data

In [6]:
df.head()

                   A         B         C         D
2020-06-22 -0.543073  1.234097  0.862813  2.059473
2020-06-23  1.086249  1.342239  0.498422  0.399590
2020-06-24  0.088308 -0.768431 -1.241454  0.768109
2020-06-25 -0.330019  1.589567  0.245061  0.894598
2020-06-26 -0.243519 -0.436227 -1.398266  1.525374

In [7]:
df.tail(2)

                   A         B         C         D
2020-06-26 -0.243519 -0.436227 -1.398266  1.525374
2020-06-27  0.670634 -0.365394 -1.289230  0.065882

In [8]:
df.index

DatetimeIndex(['2020-06-22', '2020-06-23', '2020-06-24', '2020-06-25',
               '2020-06-26', '2020-06-27'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [10]:
df2.to_numpy()

array([[1.0, Timestamp('2020-06-22 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2020-06-22 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2020-06-22 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2020-06-22 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [11]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.121430  0.432642 -0.387109  0.952171
std    0.634374  1.062313  1.030754  0.732493
min   -0.543073 -0.768431 -1.398266  0.065882
25%   -0.308394 -0.418519 -1.277286  0.491720
50%   -0.077605  0.434352 -0.498197  0.831353
75%    0.525052  1.315203  0.435082  1.367680
max    1.086249  1.589567  0.862813  2.059473

In [12]:
df.T

   2020-06-22  2020-06-23  2020-06-24  2020-06-25  2020-06-26  2020-06-27
A   -0.543073    1.086249    0.088308   -0.330019   -0.243519    0.670634
B    1.234097    1.342239   -0.768431    1.589567   -0.436227   -0.365394
C    0.862813    0.498422   -1.241454    0.245061   -1.398266   -1.289230
D    2.059473    0.399590    0.768109    0.894598    1.525374    0.065882

In [13]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2020-06-22  2.059473  0.862813  1.234097 -0.543073
2020-06-23  0.399590  0.498422  1.342239  1.086249
2020-06-24  0.768109 -1.241454 -0.768431  0.088308
2020-06-25  0.894598  0.245061  1.589567 -0.330019
2020-06-26  1.525374 -1.398266 -0.436227 -0.243519
2020-06-27  0.065882 -1.289230 -0.365394  0.670634

In [14]:
df.sort_values('A')

                   A         B         C         D
2020-06-22 -0.543073  1.234097  0.862813  2.059473
2020-06-25 -0.330019  1.589567  0.245061  0.894598
2020-06-26 -0.243519 -0.436227 -1.398266  1.525374
2020-06-24  0.088308 -0.768431 -1.241454  0.768109
2020-06-27  0.670634 -0.365394 -1.289230  0.065882
2020-06-23  1.086249  1.342239  0.498422  0.399590

In [15]:
df

                   A         B         C         D
2020-06-22 -0.543073  1.234097  0.862813  2.059473
2020-06-23  1.086249  1.342239  0.498422  0.399590
2020-06-24  0.088308 -0.768431 -1.241454  0.768109
2020-06-25 -0.330019  1.589567  0.245061  0.894598
2020-06-26 -0.243519 -0.436227 -1.398266  1.525374
2020-06-27  0.670634 -0.365394 -1.289230  0.065882

In [16]:
df[0:3] # slice exclude end #.

                   A         B         C         D
2020-06-22 -0.543073  1.234097  0.862813  2.059473
2020-06-23  1.086249  1.342239  0.498422  0.399590
2020-06-24  0.088308 -0.768431 -1.241454  0.768109

In [17]:
df['2020-06-22':'2020-06-25'] # slice include end value.

                   A         B         C         D
2020-06-22 -0.543073  1.234097  0.862813  2.059473
2020-06-23  1.086249  1.342239  0.498422  0.399590
2020-06-24  0.088308 -0.768431 -1.241454  0.768109
2020-06-25 -0.330019  1.589567  0.245061  0.894598

# Selection by label

In [18]:
df.loc['2020-06-22': '2020-06-24', ['B','C']]

                   B         C
2020-06-22  1.234097  0.862813
2020-06-23  1.342239  0.498422
2020-06-24 -0.768431 -1.241454

In [19]:
df.loc[dates[0], "A"]

-0.543072510411746

In [20]:
df.at[dates[0], "A"]

-0.543072510411746

# Selection by Position

In [21]:
df.iloc[3]

A   -0.330019
B    1.589567
C    0.245061
D    0.894598
Name: 2020-06-25 00:00:00, dtype: float64

In [22]:
df.loc[dates[3]]

A   -0.330019
B    1.589567
C    0.245061
D    0.894598
Name: 2020-06-25 00:00:00, dtype: float64

In [23]:
df.iloc[1:3, 1:3] # range slice

                   B         C
2020-06-23  1.342239  0.498422
2020-06-24 -0.768431 -1.241454

In [24]:
df.iloc[[1,2,3], [0,2]] # select

                   A         C
2020-06-23  1.086249  0.498422
2020-06-24  0.088308 -1.241454
2020-06-25 -0.330019  0.245061

# Boolean indexing

In [25]:
df

                   A         B         C         D
2020-06-22 -0.543073  1.234097  0.862813  2.059473
2020-06-23  1.086249  1.342239  0.498422  0.399590
2020-06-24  0.088308 -0.768431 -1.241454  0.768109
2020-06-25 -0.330019  1.589567  0.245061  0.894598
2020-06-26 -0.243519 -0.436227 -1.398266  1.525374
2020-06-27  0.670634 -0.365394 -1.289230  0.065882

In [26]:
df[df['A']>0]

                   A         B         C         D
2020-06-23  1.086249  1.342239  0.498422  0.399590
2020-06-24  0.088308 -0.768431 -1.241454  0.768109
2020-06-27  0.670634 -0.365394 -1.289230  0.065882

In [27]:
df[df>0]

                   A         B         C         D
2020-06-22       NaN  1.234097  0.862813  2.059473
2020-06-23  1.086249  1.342239  0.498422  0.399590
2020-06-24  0.088308       NaN       NaN  0.768109
2020-06-25       NaN  1.589567  0.245061  0.894598
2020-06-26       NaN       NaN       NaN  1.525374
2020-06-27  0.670634       NaN       NaN  0.065882

In [28]:
df2 = df.copy()
df2['E'] = ['one','one','two','three','four','three']
df2

                   A         B         C         D      E
2020-06-22 -0.543073  1.234097  0.862813  2.059473    one
2020-06-23  1.086249  1.342239  0.498422  0.399590    one
2020-06-24  0.088308 -0.768431 -1.241454  0.768109    two
2020-06-25 -0.330019  1.589567  0.245061  0.894598  three
2020-06-26 -0.243519 -0.436227 -1.398266  1.525374   four
2020-06-27  0.670634 -0.365394 -1.289230  0.065882  three

In [29]:
df2.E.isin(['one', 'two'])

2020-06-22     True
2020-06-23     True
2020-06-24     True
2020-06-25    False
2020-06-26    False
2020-06-27    False
Freq: D, Name: E, dtype: bool

In [30]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2020-06-24  0.088308 -0.768431 -1.241454  0.768109   two
2020-06-26 -0.243519 -0.436227 -1.398266  1.525374  four

In [31]:
df2.E.isin(['two','four'])

2020-06-22    False
2020-06-23    False
2020-06-24     True
2020-06-25    False
2020-06-26     True
2020-06-27    False
Freq: D, Name: E, dtype: bool

# Setting

In [32]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index = pd.date_range('20200702', periods = 6))
s1

2020-07-02    1
2020-07-03    2
2020-07-04    3
2020-07-05    4
2020-07-06    5
2020-07-07    6
Freq: D, dtype: int64

In [33]:
df.at[dates[0], ['A']] = 0
df

                   A         B         C         D
2020-06-22  0.000000  1.234097  0.862813  2.059473
2020-06-23  1.086249  1.342239  0.498422  0.399590
2020-06-24  0.088308 -0.768431 -1.241454  0.768109
2020-06-25 -0.330019  1.589567  0.245061  0.894598
2020-06-26 -0.243519 -0.436227 -1.398266  1.525374
2020-06-27  0.670634 -0.365394 -1.289230  0.065882

In [34]:
df.iat[0, 1] = 0
df

                   A         B         C         D
2020-06-22  0.000000  0.000000  0.862813  2.059473
2020-06-23  1.086249  1.342239  0.498422  0.399590
2020-06-24  0.088308 -0.768431 -1.241454  0.768109
2020-06-25 -0.330019  1.589567  0.245061  0.894598
2020-06-26 -0.243519 -0.436227 -1.398266  1.525374
2020-06-27  0.670634 -0.365394 -1.289230  0.065882

In [35]:
df.loc[:,'D'] = np.array([5]  * len(df))
df

                   A         B         C  D
2020-06-22  0.000000  0.000000  0.862813  5
2020-06-23  1.086249  1.342239  0.498422  5
2020-06-24  0.088308 -0.768431 -1.241454  5
2020-06-25 -0.330019  1.589567  0.245061  5
2020-06-26 -0.243519 -0.436227 -1.398266  5
2020-06-27  0.670634 -0.365394 -1.289230  5

In [36]:
df2 = df.copy()
df2[df2>0]= -df2
df2

                   A         B         C  D
2020-06-22  0.000000  0.000000 -0.862813 -5
2020-06-23 -1.086249 -1.342239 -0.498422 -5
2020-06-24 -0.088308 -0.768431 -1.241454 -5
2020-06-25 -0.330019 -1.589567 -0.245061 -5
2020-06-26 -0.243519 -0.436227 -1.398266 -5
2020-06-27 -0.670634 -0.365394 -1.289230 -5

# Missing data

In [37]:
df1 = df.reindex(index = dates[0:4], columns = list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C  D    E
2020-06-22  0.000000  0.000000  0.862813  5  1.0
2020-06-23  1.086249  1.342239  0.498422  5  1.0
2020-06-24  0.088308 -0.768431 -1.241454  5  NaN
2020-06-25 -0.330019  1.589567  0.245061  5  NaN

In [38]:
df1.dropna(how = 'any')

                   A         B         C  D    E
2020-06-22  0.000000  0.000000  0.862813  5  1.0
2020-06-23  1.086249  1.342239  0.498422  5  1.0

In [39]:
df1.fillna(value = 5)

                   A         B         C  D    E
2020-06-22  0.000000  0.000000  0.862813  5  1.0
2020-06-23  1.086249  1.342239  0.498422  5  1.0
2020-06-24  0.088308 -0.768431 -1.241454  5  5.0
2020-06-25 -0.330019  1.589567  0.245061  5  5.0

In [40]:
pd.isna(df1)

                A      B      C      D      E
2020-06-22  False  False  False  False  False
2020-06-23  False  False  False  False  False
2020-06-24  False  False  False  False   True
2020-06-25  False  False  False  False   True

# Operations

## stats

In [41]:
df

                   A         B         C  D
2020-06-22  0.000000  0.000000  0.862813  5
2020-06-23  1.086249  1.342239  0.498422  5
2020-06-24  0.088308 -0.768431 -1.241454  5
2020-06-25 -0.330019  1.589567  0.245061  5
2020-06-26 -0.243519 -0.436227 -1.398266  5
2020-06-27  0.670634 -0.365394 -1.289230  5

In [42]:
df.mean()

A    0.211942
B    0.226959
C   -0.387109
D    5.000000
dtype: float64

In [43]:
df.mean(1) # other axis

2020-06-22    1.465703
2020-06-23    1.981727
2020-06-24    0.769606
2020-06-25    1.626152
2020-06-26    0.730497
2020-06-27    1.004003
Freq: D, dtype: float64

In [44]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index = dates).shift(2)
s

2020-06-22    NaN
2020-06-23    NaN
2020-06-24    1.0
2020-06-25    3.0
2020-06-26    5.0
2020-06-27    NaN
Freq: D, dtype: float64

In [45]:
s1 = pd.Series([1, 3, 5, np.nan, 6, 8], index = dates).shift(1)
s1

2020-06-22    NaN
2020-06-23    1.0
2020-06-24    3.0
2020-06-25    5.0
2020-06-26    NaN
2020-06-27    6.0
Freq: D, dtype: float64

### Broadcastin Substraction

In [46]:
df.sub(s, axis='index')

                   A         B         C    D
2020-06-22       NaN       NaN       NaN  NaN
2020-06-23       NaN       NaN       NaN  NaN
2020-06-24 -0.911692 -1.768431 -2.241454  4.0
2020-06-25 -3.330019 -1.410433 -2.754939  2.0
2020-06-26 -5.243519 -5.436227 -6.398266  0.0
2020-06-27       NaN       NaN       NaN  NaN

# Apply

In [47]:
df.apply(np.cumsum)

                   A         B         C   D
2020-06-22  0.000000  0.000000  0.862813   5
2020-06-23  1.086249  1.342239  1.361235  10
2020-06-24  1.174557  0.573807  0.119781  15
2020-06-25  0.844538  2.163375  0.364842  20
2020-06-26  0.601019  1.727148 -1.033424  25
2020-06-27  1.271653  1.361754 -2.322653  30

In [48]:
df.apply(lambda x : x.max() - x.min())

A    1.416267
B    2.357998
C    2.261079
D    0.000000
dtype: float64

In [49]:
df.head()

                   A         B         C  D
2020-06-22  0.000000  0.000000  0.862813  5
2020-06-23  1.086249  1.342239  0.498422  5
2020-06-24  0.088308 -0.768431 -1.241454  5
2020-06-25 -0.330019  1.589567  0.245061  5
2020-06-26 -0.243519 -0.436227 -1.398266  5

In [50]:
df.loc[dates[1],'A'] - df.loc[dates[3], 'B']

-0.5033185287712827

In [51]:
df.max(), df.min()

(A    1.086249
 B    1.589567
 C    0.862813
 D    5.000000
 dtype: float64,
 A   -0.330019
 B   -0.768431
 C   -1.398266
 D    5.000000
 dtype: float64)

# Histogramming

In [52]:
s = pd.Series(np.random.randint(1, 7, size = 10))
s

0    6
1    4
2    5
3    5
4    4
5    1
6    1
7    1
8    2
9    2
dtype: int64

In [53]:
s.value_counts()

1    3
5    2
4    2
2    2
6    1
dtype: int64

# Merge

## Concat

In [54]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -0.731428 -1.021377 -0.263691 -1.699152
1  0.454523  1.223854 -0.171456 -0.608124
2  0.441469  0.697378  1.727376  0.346905
3 -0.507872  0.696810 -1.013680  0.205138
4 -0.642224  0.731988  1.526838  1.261584
5  0.265721 -0.094176 -0.814104  0.657331
6  2.235813 -0.835955  0.703969  0.290300
7  1.748953 -0.238517 -0.917392 -0.013313
8 -0.901172  0.299751  0.218135  0.697678
9 -1.318102  0.872957 -0.989284  0.755193

In [55]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -0.731428 -1.021377 -0.263691 -1.699152
 1  0.454523  1.223854 -0.171456 -0.608124
 2  0.441469  0.697378  1.727376  0.346905,
           0         1         2         3
 3 -0.507872  0.696810 -1.013680  0.205138
 4 -0.642224  0.731988  1.526838  1.261584
 5  0.265721 -0.094176 -0.814104  0.657331
 6  2.235813 -0.835955  0.703969  0.290300,
           0         1         2         3
 7  1.748953 -0.238517 -0.917392 -0.013313
 8 -0.901172  0.299751  0.218135  0.697678
 9 -1.318102  0.872957 -0.989284  0.755193]

In [56]:
pd.concat(pieces)

          0         1         2         3
0 -0.731428 -1.021377 -0.263691 -1.699152
1  0.454523  1.223854 -0.171456 -0.608124
2  0.441469  0.697378  1.727376  0.346905
3 -0.507872  0.696810 -1.013680  0.205138
4 -0.642224  0.731988  1.526838  1.261584
5  0.265721 -0.094176 -0.814104  0.657331
6  2.235813 -0.835955  0.703969  0.290300
7  1.748953 -0.238517 -0.917392 -0.013313
8 -0.901172  0.299751  0.218135  0.697678
9 -1.318102  0.872957 -0.989284  0.755193

# Join

In [57]:
left = pd.DataFrame({'key':['foo', 'foo'], 'lval':[1, 2]})

In [58]:
right = pd.DataFrame({'key':['foo', 'foo'], 'rval':[4, 5]})

In [59]:
left

   key  lval
0  foo     1
1  foo     2

In [60]:
right

   key  rval
0  foo     4
1  foo     5

In [61]:
pd.merge(left, right, on = 'key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

# Grouping

In [62]:
df = pd.DataFrame({'A':['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
                 'B':['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'], 
                 'C': np.random.randn(8),
                 'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.340549 -1.662584
1  bar    one -1.035239 -0.385504
2  foo    two -1.435707 -1.393534
3  bar  three -1.435166  1.739071
4  foo    two -0.255442 -0.569026
5  bar    two -0.958307  0.951627
6  foo    one -0.423067  0.856858
7  foo  three  0.672223 -0.493561

In [65]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one   -1.035239 -0.385504
    three -1.435166  1.739071
    two   -0.958307  0.951627
foo one   -0.082518 -0.805726
    three  0.672223 -0.493561
    two   -1.691149 -1.962560

# Reshaping

## Stack

In [70]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                    'foo', 'foo', 'qux', 'qux'],
                   ['one', 'two', 'one', 'two', 
                    'one', 'two', 'one', 'tow']]))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'tow')]

In [71]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [73]:
df= pd.DataFrame(np.random.randn(8, 2), index = index, columns = ['A', 'B'])
df2 = df[:4]
df2

                     A         B
first second
bar   one    -0.094531  1.699106
      two     0.022472  0.737850
baz   one    -0.388487 -0.615928
      two     0.680395 -1.534640

In [77]:
stacked = df2.stack()
stacked

first  second
bar    one     A   -0.094531
               B    1.699106
       two     A    0.022472
               B    0.737850
baz    one     A   -0.388487
               B   -0.615928
       two     A    0.680395
               B   -1.534640
dtype: float64

In [78]:
stacked.unstack(1)

second        one       two
first
bar   A -0.094531  0.022472
      B  1.699106  0.737850
baz   A -0.388487  0.680395
      B -0.615928 -1.534640

In [79]:
stacked.unstack(0)

first          bar       baz
second
one    A -0.094531 -0.388487
       B  1.699106 -0.615928
two    A  0.022472  0.680395
       B  0.737850 -1.534640

# Pivot tables

In [80]:
df = pd.DataFrame({'A':['one', 'one', 'two', 'three'] * 3,
                   'B':['A', 'B', 'C'] * 4,
                   'C':['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D': np.random.randn(12),
                   'E': np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo  0.591646 -0.438014
1     one  B  foo -0.536387  0.673695
2     two  C  foo -0.705105  1.609991
3   three  A  bar -1.140914 -0.677437
4     one  B  bar  0.645670 -0.508682
5     one  C  bar -1.421684  0.646236
6     two  A  foo  0.388333  1.985709
7   three  B  foo  0.805624 -1.771246
8     one  C  foo  0.156457  4.333893
9     one  A  bar  0.795757  1.183583
10    two  B  bar -0.580611  0.008445
11  three  C  bar -0.724460 -0.150088

In [81]:
pd.pivot_table(df, values='D', index = ['A', 'B'], columns = ['C'])

C             bar       foo
A     B
one   A  0.795757  0.591646
      B  0.645670 -0.536387
      C -1.421684  0.156457
three A -1.140914       NaN
      B       NaN  0.805624
      C -0.724460       NaN
two   A       NaN  0.388333
      B -0.580611       NaN
      C       NaN -0.705105

# Time series

In [86]:
rng = pd.date_range('7/10/2020', periods = 100, freq = 'S')

In [87]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [90]:
ts

2020-07-10 00:00:00    248
2020-07-10 00:00:01    224
2020-07-10 00:00:02    467
2020-07-10 00:00:03    303
2020-07-10 00:00:04     37
                      ...
2020-07-10 00:01:35    433
2020-07-10 00:01:36    138
2020-07-10 00:01:37    370
2020-07-10 00:01:38    255
2020-07-10 00:01:39    137
Freq: S, Length: 100, dtype: int64

In [89]:
ts.resample('5Min').sum()

2020-07-10    25644
Freq: 5T, dtype: int64

In [93]:
rng = pd.date_range('10/6/2020 00:00', periods=5, freq='D')
ts = pd.Series(np.random.randn(len(rng)), rng)
ts

2020-10-06   -1.550212
2020-10-07   -0.557707
2020-10-08    0.050710
2020-10-09   -0.469641
2020-10-10    0.383098
Freq: D, dtype: float64

In [94]:
ts_utc = ts.tz_localize('UTC')
ts_utc

2020-10-06 00:00:00+00:00   -1.550212
2020-10-07 00:00:00+00:00   -0.557707
2020-10-08 00:00:00+00:00    0.050710
2020-10-09 00:00:00+00:00   -0.469641
2020-10-10 00:00:00+00:00    0.383098
Freq: D, dtype: float64

In [98]:
ts_utc.tz_convert('Asia/Tokyo')

2020-10-06 09:00:00+09:00   -1.550212
2020-10-07 09:00:00+09:00   -0.557707
2020-10-08 09:00:00+09:00    0.050710
2020-10-09 09:00:00+09:00   -0.469641
2020-10-10 09:00:00+09:00    0.383098
Freq: D, dtype: float64

In [100]:
ts_utc.tz_convert('Asia/Seoul')

2020-10-06 09:00:00+09:00   -1.550212
2020-10-07 09:00:00+09:00   -0.557707
2020-10-08 09:00:00+09:00    0.050710
2020-10-09 09:00:00+09:00   -0.469641
2020-10-10 09:00:00+09:00    0.383098
Freq: D, dtype: float64